from celery import shared_task
from django.conf import settings
from django.core.mail import send_mail


@shared_task
def send_activation_mail(email, activation_code):
    activation_url = f'{settings.DOMAIN}/api/v1/accounts/activate/{activation_code}'
    message = f"""
        Урматтуу пользователь!
Эл аралык инновациялык технологиялар университетинин Илимий-маалыматтык китепканасынын электрондук сайтына катталганыңыз үчүн ыраазычылык билдиребиз.
Аккаунтуңузду тактоо иретинде логин пароль киргизип активдештириңиз {activation_url}
 
Илимий маалыматтык китепкананын электрондук сайтында сиз:
- өзүңүздүн профилиңизди жүргүзөсуз, анда сиз өз атыңыздан китептерди жүктөй аласыз; өзүңүзгө жаккан жана окуган китептериңизди сактасаңыз болот;
- сайттын бардык барактарынын жогорку сабында китептин аталышы боюнча издей аласыз;
- “Авторлор” бөлүмүнө өтүп, китептердин автору боюнча издөө жүргүзсөңүз болот;
- “Статистика” бөлүмүндө жүктөлгөн китептердин статистикасын көрө аласыз;
- институт тарабынан жүктөлгөн китептерди көрүүгө да болот;
- ар бир окуган китепке өз пикириңизди калтырып коюңуз;
- жана башка көптөгөн шарттар менен тааныша аласыз.
Сайтты өркүндөтүү үчүн сайттагы комментарийлериңиз бизди кызыктырат, андыктан сиз intuitkg@mail.ru дарегине темасына «Илимий маалымат китепканасы үчүн» көрсөтүү менен кат жазсаңыз болот.
 
Урматтоо менен,
Эл аралык инновациялык технологиялар университетинин
Илимий-маалымат китепканасы
 
 
Уважаемый пользователь!
Благодарим Вас за регистрацию на электронном сайте Научно-информационной библиотеки Международного университета инновационных технологий.
Активируйте ваш аккаунт внеся свой логин и пароль для достоверности {activation_url}

В электронном сайте Научно-информационной библиотеки Вы сможете:
- вести свой профиль, где имеется возможность загрузки книги от своего имени; сохранить для себя понравившиеся и читаемые книги;
- осуществить поиск по названию книг на верхней строке всех страниц сайта;
- осуществить поиск по автору книг переходив в раздел «Авторы»;
- ознакомиться со статистикой загруженных книг в разделе «Статистика»;
- просмотреть книги, загруженные по институтам;
- оставить свой отзыв под каждую книгу;
- и мн. другое.
Ваши комментарии по сайту нам интересны для улучшения работы сайта, поэтому можете написать сообщение по адресу intuitkg@mail.ru с указанием «для Научно-информационной библиотеки».
"""
    send_mail(
        subject='Активация аккаунта',
        message=message,
        from_email=settings.EMAIL_HOST_USER,
        recipient_list=(email, )
    )


@shared_task
def send_reset_email(email):
    from .models import AbstractUser
    user = AbstractUser.objects.get(email=email)
    user.create_activation_code()
    message = f"Код для восстановления пароля {user.activation_code}"
    send_mail(
        subject='Восстановление пароля',
        message=message,
        from_email=settings.EMAIL_HOST_USER,
        recipient_list=(email, )
    )

# celery
